{
    "discover": [
        {
            "Event": "Coburg Concerts in the Park",
            "Theme": "A Melodious Summer Tradition",
            "Headline": "Coburg Concerts in the Park: A Melodious Summer Tradition",
            "Season": "Summer",
            "Date": "July/August 2024",
            "Location": "Pavilion Park",
            "logo": "images/concertsInThePark.webp",
            "Webpage": "concertsinthepark.html",
            "Blurb": "Escape the daily grind and immerse yourself in the harmonious embrace of music, food, and community at Coburg Concerts in the Park. Set amidst the idyllic Pavilion Park in Coburg, this captivating 10-week concert series has become a summer tradition that brings together locals and visitors from far and wide.\nEvery week, as the golden sun sets, the park transforms into a vibrant hub of melodies and laughter. Enchanting tunes from talented musicians fill the air, creating an atmosphere of pure joy and relaxation. Whether you sway to the rhythm, tap your feet, or dance exuberantly, there's a genre to suit every musical taste.\nCoburg Concerts in the Park is more than just an event; it's a celebration of community spirit. Neighbors come together, acquaintances become friends, and memories are created that last a lifetime. As the music echoes through the park, laughter intermingles with conversations, and a genuine sense of belonging envelops each and every person present.\nJoin us for a delightful summer evening under the stars, as the community and beyond unite in the pursuit of music, delectable bites, and the cherished camaraderie that makes Coburg truly special."
        },
        {
            "Event": "Coburg Market",
            "Theme": "Discover the Vibrant Coburg Market",
            "Headline": "Discover the Vibrant Coburg Market at Pavilion Park",
            "Season": "Summer",
            "Date": "TBD",
            "Location": "Pavilion Park",
            "logo": "images/coburgMarket.webp",
            "Webpage": "/coburg-market",
            "Blurb": "Immerse yourself in the lively atmosphere of the Coburg Market, a cherished local gathering held every week during the mesmerizing Concerts in the Park. Nestled in the heart of Pavilion Park, this delightful market is the perfect destination to embrace the warm summer evenings in July and August.\nStep into a world of exquisite craftsmanship as you explore an array of hand-made jewelry, showcasing the skill and creativity of talented artisans. Admire the intricate designs, dazzling gemstones, and unique pieces that reflect the diversity and beauty of their creators.\nIndulge your senses in a sensory journey through the market's stunning collection of leather goods. From handcrafted bags and belts to stylish wallets and accessories, each item tells a story. Feel the supple texture of the finest leathers and marvel at the attention to detail that goes into every creation. As a true family-friendly destination, the market offers an array of activities to keep everyone entertained. Engage your little ones in interactive workshops, face painting, and engaging games, ensuring they create cherished memories amidst the joyful ambiance. \nCome and experience the Coburg Market at Pavilion Park, where the spirit of community comes alive against the backdrop of charming melodies. Discover extraordinary treasures, connect with local artisans, savor the flavors of local cuisine, and bask in the joyous atmosphere that permeates this beloved market."
        },
        {
            "Event": "Antique Fair",
            "Theme": "A Timeless Journey",
            "Headline": "Coburg Antique and Vintage Fair: A Timeless Journey - First Sunday After Labor Day",
            "Season": "Summer",
            "Date": "First Sunday After Labor Day",
            "Location": "Around Coburg",
            "logo": "images/coburgAntiqueFair.webp",
            "Webpage": "/antiquefair",
            "Blurb": "For over 36 years, the Coburg Antique and Vintage Fair has been enchanting visitors from near and far, making it a festival renowned worldwide. This iconic event, set against the picturesque backdrop of Downtown Coburg, transports fair goers on a captivating journey into the past.\nDrawing thousands of attendees each year, this celebrated fair has become a beloved tradition for antique enthusiasts and collectors alike. With close to 200 vendor booths, visitors can expect a treasure trove of remarkable finds, from exquisite Victorian era furniture to vintage clothing, delicate porcelain, and rare collectibles.Immerse yourself in the rich history and nostalgia that permeates every corner of the fair. Stroll leisurely through the cobblestone streets, indulging in the delightful sight of carefully curated booths overflowing with unique and one-of-a-kind items. Discover hidden gems that hold stories of generations past, revealing a glimpse into a bygone era.\nAs you wander through the fair, enchanting melodies from live musicians fill the air, adding a touch of magic to the ambiance. Savor the delectable aromas wafting from food vendors offering tantalizing treats and refreshing beverages, providing a well-deserved respite from the excitement of the fair.\nThe Coburg Antique and Vintage Fair embraces its status as an international sensation, attracting visitors from every corner of the globe. It has become a meeting point for antique enthusiasts, collectors, and historians, fostering a sense of camaraderie and shared passion that transcends geographical borders.\nJoin us for this cherished annual event, where time stands still, and the past comes alive. Whether you seek to add a new piece of history to your collection or simply desire to immerse yourself in the enchanting world of antiques, the Coburg Antique and Vintage Fair promises an unforgettable experience that will leave you longing to return year after year."
        },
        {
            "Event": "The Coburg Scarecrow Festival",
            "Theme": "A Celebration of Community and Harvest - Month long fall celebration",
            "Headline": "The Coburg Scarecrow Festival: A Celebration of Community and Harvest - Month long fall celebration",
            "Season": "Fall",
            "Date": "November",
            "Location": "Around Coburg",
            "logo": "images/coburgScarecrowFestival.webp",
            "Webpage": "/scarecrowfestival",
            "Blurb": "Step into the vibrant community of Coburg and immerse yourself in the excitement of the Coburg Scarecrow Festival! Running throughout the entire month, this beloved festival brings the town together for a celebration like no other. \nWitness the streets transform into a whimsical wonderland as members of the community unleash their creativity, competing to create the most captivating scarecrow display outside their businesses and residences. From traditional scarecrows to imaginative and unique designs, the town becomes a tapestry of artistry and autumnal charm.\nBut the pinnacle of the festival is a truly enchanting night when the entire community comes alive to celebrate the harvest. The air is filled with the melodies of live music, laughter, and the scent of delicious cuisine from the food trucks that line the streets. \nFamilies gather around fire pits to toast s’mores, the sweet aroma mingling with the crisp autumn air. Sip on warm apple cider and feel the sense of togetherness embracing the town. \nAnd this year, the Coburg Scarecrow Festival introduces two exciting additions: the Harvest Market and the Coburg Pumpkin 5k fun run. \nThe Harvest Market showcases the bountiful produce and crafts crafted by local artisans and farmers, a true celebration of the harvest season. Meanwhile, the Coburg Pumpkin 5k fun run invites participants of all ages and abilities to don their running shoes and embrace the exhilaration of a lively fall race.\nJoin us in Coburg this year and experience the magic of the Scarecrow Festival. Let the creativity, community spirit, and harvest delights captivate your senses. Celebrate the season in style and create unforgettable memories in this charming town that knows how to come together and celebrate the best of autumn."
        },
        {
            "Event": "Coburg Market Harvest Bazaar!",
            "Theme": "2024 dates are still to be scheduled.",
            "Headline": "Mark your calendars for the Coburg Market Harvest Bazaar! Every Sunday October 8th-November 5th 2:00-5:00PM",
            "Season": "Fall",
            "Date": "TBD",
            "Location": "IOOF Hall",
            "logo": "images/harvestBazaar.webp",
            "Webpage": "/harvest-bazaar",
            "Blurb": "Join us every week at Coburg I00F Hall for an exciting showcase of talent and creativity at the Coburg Market Harvest Bazaar. This beloved event is a haven for local artisans and creators, where they gather to display their exceptional craftsmanship and share their unique creations with the community.\nStep into a world of artistic wonders as you peruse the diverse range of crafts, home textiles, artwork, paper crafts, and so much more. From intricate hand-woven textiles that add warmth and charm to your home, to stunning paintings that captivate your senses, you'll find treasures for every taste and style.\nThe Coburg Market Harvest Bazaar is not just a place to purchase beautiful items, it's an experience that encourages you to connect with the talented individuals behind each creation. Engage in conversations with the makers, learning about the stories and inspirations that drove them to create these masterpieces. Their passion and dedication will leave you feeling inspired and connected to the local artistic community.\nIn addition to the variety of arts and crafts available, the market also boasts a vibrant atmosphere with live music, delicious food stalls, and a sense of community that is truly enchanting. Bring your friends and family, discover new favorites, and create memories as you explore the wonders of the Coburg Market Harvest Bazaar.\nDon't miss out on this extraordinary event! Join us every week and celebrate the creativity and talent that thrives here in Coburg. Whether you're looking for a one-of-a-kind gift, seeking inspiration, or simply want to immerse yourself in a beautiful market experience, the Coburg Market Harvest Bazaar is the place to be."
        },
        {
            "Event": "Coburg Pumpkin 5k",
            "Theme": "A Delightfully Whimsical Fun Run with a Twist",
            "Headline": "Coburg Pumpkin 5k: A Delightfully Whimsical Fun Run with a Twist",
            "Season": "Fall",
            "Date": "TBD",
            "Location": "Around Coburg",
            "logo": "images/coburgPumpkin5k.jpg",
            "Webpage": "/coburg-pumpkin-5k-fun-run",
            "Blurb": "Step into the spirit of autumn at the Coburg Pumpkin 5k, a one-of-a-kind event taking place at Pavilion Park in the charming town of Coburg. This festive fun run/walk will lead participants through the scenic town, offering a captivating route filled with amazing sights.\nAs you navigate the path, you'll be greeted by captivating Scarecrow displays, remnants of the recent Scarecrow Festival held in Coburg. Marvel at the creativity and artistry showcased in these whimsical creations, each one telling its own story and adding a touch of magic to your journey.\nWhat sets this event apart from traditional 5k runs is its unique twist: participants are encouraged to carry their own pumpkin throughout the course. Whether you choose a petite pumpkin or a hefty one, the weight on your shoulders adds an extra challenge, bringing an element of fun and excitement.\nThe Coburg Pumpkin 5k is not a timed race but rather a celebration of community, joy, and embracing the spirit of the season. As you cross the finish line, two distinct titles await the triumphant participants: the first runner to reach the end and the individual with the heaviest pumpkin. These winners will forever be remembered as the champions of this memorable event. While trophies await the winners, all registered participants will receive a medal upon crossing the finish line!\nSo gather your friends, family, and neighbors, and join us at Pavilion Park on October 28th for the Coburg Pumpkin 5k. Discover the beauty of Coburg, immerse yourself in the magic of the Scarecrow displays, and revel in the laughter and camaraderie that fills the air. Together, let's create cherished memories and celebrate everything that makes autumn truly remarkable."
        },
        {
            "Event": "Coburg After Hours",
            "Theme": "Unleash the Fun, Unleash Your Business",
            "Headline": "Coburg Business After Hours: Unleash the Fun, Unleash Your Business",
            "Season": "All",
            "Date": "Monthly",
            "Location": "Hosted event, different every time",
            "logo": "images/businessAfterHours.jpg",
            "Webpage": "/contact",
            "Blurb": "Looking for that perfect mix of business promotion, networking, and unwinding in a delightful setting? Look no further than Coburg Business After Hours! \nJoin us for an unforgettable evening where local business owners and community leaders come together in a relaxed and engaging atmosphere. Coburg Main Street invites you to kick back, connect, and collaborate with like-minded peers who share your entrepreneurial spirit.\nThese highly anticipated events are not your typical business gatherings. They an undeniably fun way to take your business to new heights. Coburg Business After Hours allows you to showcase your business to a captive audience. With ample branding opportunities and meaningful interactions, you’ll gain exposure and increase your chances of attracting new customers. The synergy of entrepreneurs and community leaders coming together creates a buzz that will leave a lasting impression on everyone involved. \nIt's time to unlock the untapped potential of your business while forming valuable connections, all while having a blast in the company of like-minded business owners and community leaders. Please watch out for future dates and let us know if your business would like to host one of these fantastic evening events!"
        },
        {
            "Event": "Christmas in Cobrg",
            "Theme": "A Blissful Community Extravaganza!",
            "Headline": "Celebrate Christmas in Coburg! A Blissful Community Extravaganza!",
            "Season": "Winter",
            "Date": "December 7th 2024",
            "Location": "Around Coburg",
            "logo": "images/christmasInCoburg.jpg",
            "Webpage": "/christmas-in-coburg",
            "Blurb": "Embrace the enchantment of the holiday season as Coburg comes alive with a spectacular Christmas event like no other. Join us for a heartwarming celebration filled with cherished traditions and joyful merriment. \nKick off the festivities with a visit from the jolly man himself—Santa Claus will be gracing us with his presence! Watch the wonder unfold on the faces of little ones as they whisper their wishes and share their holiday dreams with the beloved Santa Claus. \nBe serenaded by the soothing harmonies of carolers, their melodious voices echoing through Pavilion Park. Experience the uplifting power of timeless carols as they weave their magic, warming the hearts of all who listen with their melodious notes. \nStep into a winter wonderland at our mesmerizing holiday market, brimming with unique treasures and handcrafted wares. From beautifully adorned ornaments to one-of-a-kind gifts, discover treasures that will ignite your holiday spirit and make perfect presents for loved ones.  \nPrepare to be dazzled by our sensational light parade, illuminating the night sky with a mesmerizing display of twinkling lights. Witness the magic as brilliantly decorated floats glide through the streets, unfolding a tapestry of color and joy that captures the essence of the season. Above all, let us celebrate the heartwarming spirit of our Coburg community that makes this event truly special. Come together with friends, neighbors, and loved ones to create lasting memories and embrace the joyous atmosphere that only Christmas in Coburg can offer. Join us as we herald the most wonderful time of the year with open hearts, warm smiles, and an abundance of holiday spirit!\nMark your calendars and get ready to experience the magic that is Christmas in Coburg—a celebration that will ignite your holiday spirit and leave you with cherished memories to last a lifetime."
        }
    ]
}